renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
#if (MYLINKXS_REMOTE_CONTROL == 1)
    //Devido ao arduino estou colocando um byte a mais de final de frame 'Z'=0x5A
	frame[cmd_size] = BYTE_END_FRAME;
	cmd_size++;

    DBG_LOG(DBG_READ,("Req=%x %x %x %x\n",frame[0],frame[1],frame[2],frame[3]));


    osens_mote_send_frame(frame, cmd_size);



#else
    	if (osens_mote_send_frame(frame, cmd_size) != cmd_size)
    	return OSENS_STATE_EXEC_ERROR;
#endif

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_pt_val_ans(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t size;
    uint8_t ans_size;

    point = schedule.scan.index[st->point_index];
    ans_size = 6 + datatype_sizes[sensor_points.points[point].desc.type];

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

#if (MYLINKXS_REMOTE_CONTROL == 0)

    // retry ?
    if (size != ans_size || ans.hdr.addr != (OSENS_REGMAP_READ_POINT_DATA_1 + point))
        return OSENS_STATE_EXEC_OK;

    // ok, save and go to the next
    memcpy(&sensor_points.points[point].value, &ans.payload.point_value_cmd, sizeof(osens_point_t));
#else
    memcpy(&sensor_points.points[point].value, &ans.payload.point_value_cmd, sizeof(osens_point_t));

    DBG_LOG(DBG_READ,("Res=%d %s %x \n",point,sensor_points.points[point].desc.name, sensor_points.points[point].value.value.u16));
	leds_error_toggle();

#endif  // if (MYLINKXS_REMOTE_CONTROL == 0)

    st->retries = 0;
    st->point_index++;

#if TRACE_ON == 1
    osens_mote_show_values();
#endif

    return OSENS_STATE_EXEC_OK;
}

#if MYLINKXS_REMOTE_CONTROL

void simula_envio_cmd(osens_point_t *pt)
{
    flagwriteenable = 1;
}
#endif

static uint8_t osens_mote_sm_func_req_pt_val(osens_mote_sm_state_t *st)
{
	uint8_t point;
#if MYLINKXS_REMOTE_CONTROL
	uint8_t uc;
	uint8_t ucBotao=0;
	osens_point_t pt;
#endif

	// end of point reading
    if(st->point_index >= schedule.scan.num_of_points)
    	return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
	st->retries++;
	if(st->retries > 3)
		return OSENS_STATE_EXEC_ERROR;

	point = schedule.scan.index[st->point_index];
    cmd.hdr.addr = OSENS_REGMAP_READ_POINT_DATA_1 + point;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);

#if MYLINKXS_REMOTE_CONTROL
	//PROVISORIO!!!!
	ucBotao = GPIOPinRead(GPIO_A_BASE, GPIO_PIN_3);
	if ((ucBotao & GPIO_PIN_3) == 0) {
		pt.type = OSENS_DT_U16;
		pt.value.u16 = 0x820;
		sm_state.state = OSENS_STATE_WR_PT;
		simula_envio_cmd(&pt);
		osens_set_pvalue(0,&pt);
	}
#endif

	return osens_mote_pack_send_frame(&cmd, 4);

}

#if 0
static uint8_t osens_mote_sm_func_proc_wr_pt(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t size;
	uint8_t ans_size = 5;

    point = schedule.write.index[st->point_index];

#if (MYLINKXS_REMOTE_CONTROL == 1)
   if(flagwriteenable)
   {
	   flagwriteenable = 0;
	   st->retries = 0;
   }
#endif

   size = osens_unpack_cmd_res(&ans, frame, ans_size);

	// retry ?
	if (size != ans_size || ans.hdr.addr != (OSENS_REGMAP_WRITE_POINT_DATA_1 + point))
		return OSENS_STATE_EXEC_OK;

    // ok,  go to the next
    schedule.write.cons = PC_INC_QUEUE(schedule.write.cons, OSENS_MAX_POINTS);
    st->retries = 0;

    return OSENS_STATE_EXEC_OK;
}
#else
static uint8_t osens_mote_sm_func_proc_wr_pt(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t size;
	uint8_t ans_size = 5;

    point = schedule.write.index[st->point_index];
#if (MYLINKXS_REMOTE_CONTROL == 1)
   if(flagwriteenable)
   {
	   flagwriteenable = 0;
	   st->retries = 0;
   }
#endif

   size = osens_unpack_cmd_res(&ans, frame, ans_size);

    // retry ?
    if (size != ans_size || ans.hdr.addr != (OSENS_REGMAP_WRITE_POINT_DATA_1 + point))
    {
	  // DBG_LOG(DBG_WRITE,("WrRes ERROR I:%x R:%x L:%x PAR:%x \n",st->point_index,st->retries,size,ans.hdr.addr));
       return OSENS_STATE_EXEC_OK;
    }

    // ok,  go to the next
    //DBG_LOG(DBG_WRITE,("WrRes OK I:%x R:%x L:%x PAR:%x \n",st->point_index,st->retries,size,ans.hdr.addr));
    schedule.write.cons = PC_INC_QUEUE(schedule.write.cons, OSENS_MAX_POINTS);
    st->retries = 0;

    return OSENS_STATE_EXEC_OK;
}
#endif

static uint8_t osens_mote_sm_func_wr_pt(osens_mote_sm_state_t *st)
{
	uint8_t point;
	uint8_t c = schedule.write.cons;
	uint8_t p = schedule.write.prod;
	uint8_t size;

	leds_debug_toggle();

    //DBG_LOG(0,("WrReq0=%x %x %x\n",c,p,st->retries));
 	// end of point writing
	if(c == p)
		return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
	st->retries++;
	if(st->retries > 3)
		return OSENS_STATE_EXEC_ERROR;

#if TRACE_ON == 1
    printf("==> Consuming at position %d\n", c);
#endif

    st->point_index = c;
    point = schedule.write.index[st->point_index];
    cmd.hdr.addr = OSENS_REGMAP_WRITE_POINT_DATA_1 + point;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);

    size = 5 + datatype_sizes[sensor_points.points[point].desc.type];
    memcpy(&cmd.payload.point_value_cmd, &sensor_points.points[point].value, sizeof(osens_point_t));

    //DBG_LOG(DBG_WRITE,("WrReq I:%x T:%x V:%x\n",point, sensor_points.points[point].desc.type, sensor_points.points[point].value.value.u16));

    return osens_mote_pack_send_frame(&cmd,size);
}


#if (USE_SPI_INTERFACE == 0)
static uint8_t osens_mote_sm_func_run_sch(osens_mote_sm_state_t *st){
    uint8_t n;

	// priorize writings over data scan/schedule execution
	if(schedule.write.prod != schedule.write.cons)
	{
    	st->retries = 0;
		return OSENS_STATE_EXEC_ERROR;
	}

    schedule.scan.num_of_points = 0;

    for (n = 0; n < schedule.num_of_points; n++)
    {

	    if(schedule.points[n].counter > 0)
    		schedule.points[n].counter--;

        if (schedule.points[n].counter == 0)
        {
            // n: point index in the schedule database
            // index: point index in the points database
            uint8_t index = schedule.points[n].index;

    	    //DBG_LOG(0,("Sch n:%d idx:%d \n",n,schedule.points[n].index));

            schedule.scan.index[schedule.scan.num_of_points] = index;
        	schedule.scan.num_of_points++;
            // restore counter value for next cycle
            schedule.points[n].counter = schedule.points[n].sampling_time_x250ms;
        }

