renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
    }

    if(schedule.scan.num_of_points > 0)
    {
    	st->point_index = 0;
    	st->retries = 0;

     	return OSENS_STATE_EXEC_WAIT_ABORT;
    }
    else
    	return OSENS_STATE_EXEC_WAIT_OK;

}

#else

static uint8_t osens_mote_sm_func_run_sch(osens_mote_sm_state_t *st) {
#if (SONOMA14 == 1)
    uint32_t param[5];
#else
    int8_t i8Data[6] = {0};
    uint16_t u16X, u16Y, u16Z;
#endif

    leds_debug_toggle();

#if (SONOMA14 == 1)

    param[0] = read_reg(SONOMA_ADDR_VA_RMS);
    param[1] = read_reg(SONOMA_ADDR_S0_GAIN);
    param[2] = read_reg(SONOMA_ADDR_S1_GAIN);
    param[3] = read_reg(SONOMA_ADDR_S0_OFFSET);
    param[4] = read_reg(SONOMA_ADDR_S1_OFFSET);

    sensor_points.points[0].value.value.u32 = param[0];
    sensor_points.points[1].value.value.u32 = param[1];
    sensor_points.points[2].value.value.u32 = param[3];

#else
    accReadReg2(ACC_X_LSB, (uint8_t *)i8Data, 6);

    u16X = (((uint16_t)(i8Data[1]) << 2) | ((i8Data[0] >> 6) & 0x03));
    u16Y = (((uint16_t)(i8Data[3]) << 2) | ((i8Data[2] >> 6) & 0x03));
    u16Z = (((uint16_t)(i8Data[5]) << 2) | ((i8Data[4] >> 6) & 0x03));

    sensor_points.points[0].value.value.u16 = u16X;
    sensor_points.points[1].value.value.u16 = u16Y;
    sensor_points.points[2].value.value.u16 = u16Z;
#endif

#if ENABLE_DEBUG_RFF
	 uint8_t pos=0;
	 uint8_t *paux;

	 rffbuf[pos++]= 0x80;
	 paux = (uint8_t*) &param[0];
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 paux = (uint8_t*) &param[1];
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 paux = (uint8_t*) &param[2];
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;
	 rffbuf[pos++]= *paux++;

     openserial_printStatus(STATUS_RFF,(uint8_t*)&rffbuf,pos);
#endif

	return OSENS_STATE_EXEC_WAIT_OK;
}
#endif

static uint8_t osens_mote_sm_func_build_sch(osens_mote_sm_state_t *st)
{
	uint8_t n, m;

    schedule.num_of_points = 0;

    for (n = 0, m = 0; n < board_info.num_of_points; n++)
    {
        if ((sensor_points.points[n].desc.access_rights & OSENS_ACCESS_READ_ONLY) &&
            (sensor_points.points[n].desc.sampling_time_x250ms > 0))
        {
            schedule.points[m].index = n;
            schedule.points[m].counter = sensor_points.points[n].desc.sampling_time_x250ms;
            schedule.points[m].sampling_time_x250ms = sensor_points.points[n].desc.sampling_time_x250ms;

            m++;
            schedule.num_of_points++;
        }
    }

#if TRACE_ON == 1
    OS_UTIL_LOG(1,("\n"));
    OS_UTIL_LOG(1, ("Schedule\n"));
    OS_UTIL_LOG(1, ("========\n"));
    for (n = 0; n < schedule.num_of_points; n++)
    {
        OS_UTIL_LOG(1, ("[%d] point %02d at %dms\n", n, schedule.points[n].index, schedule.points[n].sampling_time_x250ms * 250));
    }
#endif

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_pt_desc_ans(osens_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 20;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size || (ans.hdr.addr != OSENS_REGMAP_POINT_DESC_1 + st->point_index))
        return OSENS_STATE_EXEC_ERROR;

    // save description and type, value is not available yet
    memcpy(&sensor_points.points[st->point_index].desc,&ans.payload.point_desc_cmd,sizeof(osens_point_desc_t));
    sensor_points.points[st->point_index].value.type = sensor_points.points[st->point_index].desc.type;

#if TRACE_ON == 1
    {
        uint8_t n = st->point_index;
        OS_UTIL_LOG(1, ("\n"));
        OS_UTIL_LOG(1, ("Point %02d info\n", n));
        OS_UTIL_LOG(1, ("=============\n"));
        OS_UTIL_LOG(1, ("Name     : %-8s\n", sensor_points.points[n].desc.name));
        OS_UTIL_LOG(1, ("Type     : %d\n", sensor_points.points[n].desc.type));
        OS_UTIL_LOG(1, ("Unit     : %d\n", sensor_points.points[n].desc.unit));
        OS_UTIL_LOG(1, ("Rights   : %02X\n", sensor_points.points[n].desc.access_rights));
        OS_UTIL_LOG(1, ("Sampling : %d\n\n", sensor_points.points[n].desc.sampling_time_x250ms));
    }
#endif

    st->retries = 0;
    st->point_index++;
    sensor_points.num_of_points = st->point_index;

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_req_pt_desc(osens_mote_sm_state_t *st)
{
    if(st->point_index >= board_info.num_of_points)
    	return OSENS_STATE_EXEC_WAIT_ABORT;

    // error condition after 3 retries
    st->retries++;
    if (st->retries > 3)
        return OSENS_STATE_EXEC_ERROR;

    cmd.hdr.addr = OSENS_REGMAP_POINT_DESC_1 + st->point_index;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}

static uint8_t osens_mote_sm_func_proc_brd_id_ans(osens_mote_sm_state_t *st)
{
	uint8_t size;
    uint8_t ans_size = 28;

    st->point_index = 0;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

    if (size != ans_size)
    	return OSENS_STATE_EXEC_ERROR;

    memcpy(&board_info, &ans.payload.brd_id_cmd, sizeof(osens_brd_id_t));

    if ((board_info.num_of_points == 0) || (board_info.num_of_points > OSENS_MAX_POINTS))
    	return OSENS_STATE_EXEC_ERROR;

#if TRACE_ON == 1
    OS_UTIL_LOG(1, ("\n"));
    OS_UTIL_LOG(1, ("Board info\n"));
    OS_UTIL_LOG(1, ("==========\n"));
    OS_UTIL_LOG(1, ("Manufactor : %-8s\n", board_info.manufactor));
    OS_UTIL_LOG(1, ("Model      : %-8s\n", board_info.model));
    OS_UTIL_LOG(1, ("ID         : %08X\n", board_info.sensor_id));
    OS_UTIL_LOG(1, ("HW REV     : %02X\n", board_info.hardware_revision));
    OS_UTIL_LOG(1, ("Capabilties: %02X\n", board_info.cabalities));
    OS_UTIL_LOG(1, ("Points     : %d\n\n", board_info.num_of_points));
#endif

    sensor_points.num_of_points = 0;
    st->retries = 0;

    return OSENS_STATE_EXEC_OK;
}

static uint8_t osens_mote_sm_func_req_brd_id(osens_mote_sm_state_t *st)
{
	cmd.hdr.size = 4;
	cmd.hdr.addr = OSENS_REGMAP_BRD_ID;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}


static uint8_t osens_mote_sm_func_proc_itf_ver_ans(osens_mote_sm_state_t *st)
{
    uint8_t size;
    uint8_t ans_size = 6;

    size = osens_unpack_cmd_res(&ans, frame, ans_size);

	if (size != ans_size)
    	return OSENS_STATE_EXEC_ERROR;

