renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
    if ((OSENS_ANS_OK != ans.hdr.status) || (OSENS_LATEST_VERSION != ans.payload.itf_version_cmd.version))
    	return OSENS_STATE_EXEC_ERROR;


    return OSENS_STATE_EXEC_OK;
}


static uint8_t osens_mote_sm_func_wait_ans(osens_mote_sm_state_t *st)
{

	/* TODO!!!! MELHORAR O Tratamento do final de frame
	 * Devido ao problema da UART nao estar reconhecendo o final do frame
	 * a rotina esperar um ciclo de scan (250ms) entao se recebeu algum dado ele diz
	 * que recebeu o frame. Posteriormente sera tratado o frame e verificado se recebeu tudo
	 */
	if ((st->trmout_counter > 0) && (num_rx_bytes > 3))
	{
        st->frame_arrived = 1;
		num_rx_bytes = 0;
	}

	if(st->frame_arrived)
	{
        st->frame_arrived = 0;
		return OSENS_STATE_EXEC_WAIT_STOP;
	}

	st->trmout_counter++;

	if(st->trmout_counter > st->trmout)
	{
		//se ocorreu timeout e existe bytes no buffer rx considero que recebeu msg
		if (num_rx_bytes > 0)
		{
			return OSENS_STATE_EXEC_WAIT_STOP;
		}
		else
		{
			return OSENS_STATE_EXEC_WAIT_ABORT;
		}
	}

	return OSENS_STATE_EXEC_WAIT_OK;
}


static uint8_t osens_mote_sm_func_req_ver(osens_mote_sm_state_t *st)
{
    cmd.hdr.addr = OSENS_REGMAP_ITF_VERSION;
    st->trmout_counter = 0;
    st->trmout = MS2TICK(5000);
    return osens_mote_pack_send_frame(&cmd, 4);
}


static uint8_t osens_mote_sm_func_init(osens_mote_sm_state_t *st)
{
	uint8_t ret = OSENS_STATE_EXEC_OK;
#if (MYLINKXS_REMOTE_CONTROL == 1) ||  (SENSOR_ACCEL == 1) ||  (SONOMA14 == 1)
	uint8_t pointpos=0;
#endif

	leds_error_on();

	memset(&cmd, 0, sizeof(cmd));
	memset(&ans, 0, sizeof(ans));
    memset(&sensor_points, 0, sizeof(sensor_points));
	memset(&board_info, 0, sizeof(board_info));
	memset(&schedule, 0, sizeof(schedule));
	memset(st, 0, sizeof(osens_mote_sm_state_t));

	num_rx_bytes=0;


#if MYLINKXS_REMOTE_CONTROL
    strcpy((void *)board_info.model, (void *) "ARDUINO");
    strcpy((void *)board_info.manufactor,(void *) "ARDUINO");
    board_info.sensor_id = 0x1;
    board_info.hardware_revision = 0x01;
    board_info.num_of_points = 5;
    board_info.capabilities = 0;

    sensor_points.num_of_points = 5;
    pointpos=0;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR1ONOFF");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR2_PP");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR2_MM");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR3_PP");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "CTR3_MM");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

#endif

#if (SENSOR_ACCEL == 1)
    strcpy((void *)board_info.model, (void *) "accbma");
    board_info.model[OSENS_MODEL_NAME_SIZE-1] = 0;
    strcpy((void *)board_info.manufactor,(void *) "TexasIns");
    board_info.model[OSENS_MANUF_NAME_SIZE-1] = 0;
    board_info.sensor_id = 0x1;
    board_info.hardware_revision = 0x01;
    board_info.num_of_points = 3;
    board_info.capabilities = 0;

    sensor_points.num_of_points = 3;
    pointpos=0;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "EIXO_X");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_ONLY;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "EIXO_Y");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_ONLY;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

    pointpos++;
    strcpy((char *)sensor_points.points[pointpos].desc.name, "EIXO_Z");
    sensor_points.points[pointpos].desc.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].desc.unit = 0; // TDB
    sensor_points.points[pointpos].desc.access_rights = SENS_ITF_ACCESS_READ_ONLY;
    sensor_points.points[pointpos].desc.sampling_time_x250ms = 1;
    sensor_points.points[pointpos].value.type = SENS_ITF_DT_U16;
    sensor_points.points[pointpos].value.value.u16 = 0;

#endif


#if (SONOMA14 == 1)
    strcpy((void *)board_info.model, (void *) "sonoma ");
    board_info.model[OSENS_MODEL_NAME_SIZE-1] = 0;
    strcpy((void *)board_info.manufactor,(void *) "Maxim  ");
    board_info.model[OSENS_MANUF_NAME_SIZE-1] = 0;
    board_info.sensor_id = 0x1;
    board_info.hardware_revision = 0x01;
    board_info.num_of_points = 3;
    board_info.capabilities = 0;

