renfernand/cc2538em/cc2538em-master/openwsn/bsp/boards/cc2538em/osens_itf/osens_itf_mote.c
#if MYLINKXS_LIGHT_CONTROL
uint8_t osens_init(void)
{
	//configura os ios do sensor
	light_init();

	//configura o profile do sensor
	leds_error_on();

	memset(&cmd, 0, sizeof(cmd));
	memset(&ans, 0, sizeof(ans));
    memset(&sensor_points, 0, sizeof(sensor_points));
	memset(&board_info, 0, sizeof(board_info));
	memset(&schedule, 0, sizeof(schedule));

    strcpy((void *)board_info.model, (void *) "CC2538EM_");
    strcpy((void *)board_info.manufactor,(void *) "TexasInstr");
    board_info.sensor_id = 0x1;
    board_info.hardware_revision = 0x01;
    board_info.num_of_points = 1;
    board_info.capabilities = 0;

    sensor_points.points[0].desc.type = 1;
    sensor_points.points[0].desc.type = 1;

    strcpy((char *)sensor_points.points[0].desc.name, "LIGHT");
    sensor_points.points[0].desc.type = SENS_ITF_DT_U8;
    sensor_points.points[0].desc.unit = 0; // TDB
    sensor_points.points[0].desc.access_rights = SENS_ITF_ACCESS_READ_WRITE;
    sensor_points.points[0].desc.sampling_time_x250ms = 1;
    sensor_points.points[0].value.type = SENS_ITF_DT_U8;
    sensor_points.points[0].value.value.u8 = 10;
    sensor_points.num_of_points = 1;

    osens_mote_init();

    return 0;
}


static void light_mote_tick(void)
{
	scheduler_push_task((task_cbt) light_mote_sm, TASKPRIO_OSENS_MAIN);
}

uint8_t osens_mote_init(void)
{

	//Inicializo a maquina de estado como ja rodando pois profile é fixo
	memset(&sm_state, 0, sizeof(osens_mote_sm_state_t));
	sm_state.state = OSENS_STATE_RUN_SCH;

	//buBufFlush();
	opentimers_start(OSENS_SM_TICK_MS, TIMER_PERIODIC, TIME_MS, (opentimers_cbt) light_mote_tick);

	return 0;
}

uint8_t osens_set_pvalue(uint8_t index, osens_point_t *point)
{

#if 0
	// switch on the light pulse (50 ms)
	light_on();

	//opentimers_start(1000,TIMER_ONESHOT,TIME_MS,light_timer);
#else
    if (point->value.u8 > 0){
    	light_on();
    }
    else{
    	light_off();
    }

#endif
	return 1;
}

// Provisorio liga lampada
uint8_t osens_liga_lampada_local(void)
{
	osens_point_t point;

	point.type=0;
    point.value.u8=1;

	osens_set_pvalue(0, &point);

	return 0;
}

#else


uint8_t osens_init(void)
{
	osens_mote_init();


	return 0;
}

uint8_t osens_mote_init(void)
{

	memset(&sm_state, 0, sizeof(osens_mote_sm_state_t));
	sm_state.state = OSENS_STATE_INIT;

#if MYLINKXS_REMOTE_CONTROL
    //config botao PROVISORIO!!! SO PARA TESTE
	GPIOPinTypeGPIOInput(BSP_LIGHT_BOTAO_BASE,BSP_LIGHT_BOTAO);
	IOCPadConfigSet(BSP_LIGHT_BOTAO_BASE, BSP_LIGHT_BOTAO, IOC_OVERRIDE_PUE);
#endif

#if  (SENSOR_ACCEL == 1)
    // Initialize accelerometer
    accInit();
#endif

    opentimers_start(OSENS_SM_TICK_MS, TIMER_PERIODIC, TIME_MS, (opentimers_cbt) osens_mote_tick);

    return 0;
}


uint8_t osens_set_pvalue(uint8_t index, osens_point_t *point)
{
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index < sensor_points.num_of_points))
	{
		if(sensor_points.points[index].desc.access_rights & OSENS_ACCESS_WRITE_ONLY)
		{
			uint8_t pn;
			uint8_t p = schedule.write.prod;
			uint8_t c = schedule.write.cons;

			pn = PC_INC_QUEUE(p,OSENS_MAX_POINTS);

			// no space in prod/cons queue (check next)
			if (pn == c)
            {
#if TRACE_ON == 1
//                printf("==> No space in writing queue (P: %d->%d, C: %d)\n",p,pn,c);

    		    DBG_LOG(DBG_WRITE,("QueueFull (P: %d->%d, C: %d)\n",p,pn,c));
#endif
    		    return 0;
            }

#if TRACE_ON == 1
            printf("==> Producing at position %d\n", p);
#endif
			// schedule point for writing and update value
#if MYLINKXS_REMOTE_CONTROL
			schedule.write.index[p] = index;
			schedule.write.prod = pn;
		    //DBG_LOG(0,("WrReq=%x %x P:%d->%d c:%d\n",index,point->value,p,pn,c));
#else
			schedule.write.index[p] = index;
			sensor_points.points[index].value.value = point->value;
			schedule.write.prod = pn;
#endif
			// run the mote state machine
			scheduler_push_task((task_cbt) osens_mote_sm, TASKPRIO_OSENS_MAIN);

			return 1;
		}
		else
			return 0;
	}
	else
		return 0;
}

#endif  //#if MYLINKXS_LIGHT_CONTROL

uint8_t osens_get_num_points(void)
{
	if(sm_state.state >= OSENS_STATE_SEND_PT_DESC)
	{
		return board_info.num_of_points;
	}
	else
		return 0;
}

uint8_t osens_get_brd_desc(osens_brd_id_t *brd)
{
	if(sm_state.state >= OSENS_STATE_SEND_PT_DESC)
	{
		memcpy(brd,&board_info,sizeof(osens_brd_id_t));
		return 1;
	}
	else
		return 0;
}

uint8_t osens_get_pdesc(uint8_t index, osens_point_desc_t *desc)
{
#if (MYLINKXS_LIGHT_CONTROL == 0)
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index <= sensor_points.num_of_points))
	{
		memcpy(desc,&sensor_points.points[index].desc,sizeof(osens_point_desc_t));
		return 1;
	}
	else
		return 0;
#else
	//teste rff
	sensor_points.points[0].desc.unit = index;
	sensor_points.points[0].desc.access_rights = sm_state.state;
	sensor_points.points[0].desc.sampling_time_x250ms = sensor_points.num_of_points;
	//teste rff

	memcpy(desc,&sensor_points.points[0].desc,sizeof(osens_point_desc_t));
	return 1;
#endif
}

int8_t osens_get_ptype(uint8_t index)
{
#if 1
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index <= sensor_points.num_of_points))
	{
		return sensor_points.points[index].value.type;
	}
	else
		return -1;
#else
	return sensor_points.points[0].value.type;
#endif

}

uint8_t osens_get_point(uint8_t index, osens_point_t *point)
{
#if 1 //teste rff
	if((sm_state.state >= OSENS_STATE_RUN_SCH) && (index <= sensor_points.num_of_points))
	{
		memcpy(point,&sensor_points.points[0].value,sizeof(osens_point_t));
		return 1;
	}
	else
		return 0;
#else
	memcpy(point,&sensor_points.points[0].value,sizeof(osens_point_t));
	return 1;

#endif

}

/**************************************************************************//**
* @brief    This function puts up to \e size bytes into the BSP UART TX
*           buffer and starts to transfer data over UART.
*
*           If \b BSP_UART_ALL_OR_NOTHING is defined, data is put into the
*           TX buffer only if there is room for all \e size bytes.
*
* @param    frame            is a pointer to the source buffer.
* @param    size            is the number of bytes to transfer.
*
* @return   Returns the number of bytes actually copied to the TX buffer.
******************************************************************************/
#if (USE_SPI_INTERFACE == 0)
uint8_t osens_mote_send_frame(uint8_t *frame, uint8_t size)
{
 	uint16_t ui16Length=size;
    register uint16_t ui16Idx = 0;

    DISABLE_INTERRUPTS();
    while((ui16Idx < ui16Length))
    {
        UARTCharPut(BSP_UART_BASE, frame[ui16Idx++]);
    }
    ENABLE_INTERRUPTS();

    return ((uint8_t) ui16Length);
}
#endif
/**************************************************************************//**
* @brief    This function pushes a byte from the UART RX FIFO to the BSP UART
*           RX buffer. The function handles RX buffer wrap-around, but does not
*           handle RX buffer overflow. The function should only be called if
*           there is data in the UART RX FIFO. It modifies volatile variables
*           and should only be called when interrupts are disabled.
*
* @brief    None
******************************************************************************/
static void buBufPushByte(void)
{
    uint32_t value;

